Revit 2024 API
Curve.IsClosed Property
Describes whether the curve is closed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool IsClosed { get; }
Visual Basic
Public ReadOnly Property IsClosed As Boolean
	Get
Visual C++
public:
property bool IsClosed {
	bool get ();
}
Remarks
A curve is "closed" if it is bounded and its start and end points coincide (to within Revit's 3D tolerance), or if it is unbounded and periodic.
See Also
Curve Class
Autodesk.Revit.DB Namespace